Documents/УстановкаУсловийПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаУсловийПребывания</Name>
			<Comment>Установка условий пребывания в стационаре</Comment>
			<BasedOn>
				<xr:Item>Document.ОбращениеВСтационар</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияПребывания</xr:Item>
				<xr:Item>InformationRegister.омг_ТекущиеМедицинскиеКарты</xr:Item>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
				<xr:Item>InformationRegister.КлиентыСтационара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияВСтационаре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбращения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВСтационар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/омг_ТекущиеМедицинскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ТекущиеМедицинскиеКарты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МедицискаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвиженияВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДвиженияВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводМеждуПодразделениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амбулаторная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоматологическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стационар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГинекологическаяБеременной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_СтационарРК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращениеВСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбращениеВСтационар</Name>
			<BasedOn>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.ОказаниеУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛечащийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившееУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьДоставленСкоройПомощью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленПоЭкстреннымПоказателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезЧасовПослеНачалаЗаболевания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаГоспитализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщитьРодственникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказВГоспитализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказаВГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьПричиныОтказаВГоспитализации</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйПовторныйОтказ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтказаВГоспитализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыГоспитализации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлкогольноеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаркотическоеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГоспитализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗафиксировавшийОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеДатаВремяВзятияПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеРезультатВзятияПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяИнформированияЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационараНаправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаУсловийПребывания/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОбращения") Тогда 
			ЗаполнитьНаОснованииОбращения(ДанныеЗаполнения.ДокументОбращения);	
		ИначеЕсли ДанныеЗаполнения.Свойство("ДокументОснование")
			И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.БронированиеКойкоМеста")
		Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ДокументОснование, "Клиент, Палата, КойкоМесто, ДатаНачала, ДатаОкончания");
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Палата") Тогда
			Палата = ДанныеЗаполнения.Палата;
			Если Не ЗначениеЗаполнено(Прейскурант)
				И ЗначениеЗаполнено(Палата.ВидПалаты)
			Тогда
				Прейскурант = Палата.ВидПалаты.Прейскурант;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Койка") Тогда
			ЭтотОбъект.КойкоМесто = ДанныеЗаполнения.Койка;
		КонецЕсли;
		
		ДанныеЗаполнения.Свойство("Полис", Полис);
			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОбращениеВСтационар") Тогда
		
		ЗаполнитьНаОснованииОбращения(ДанныеЗаполнения)
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Клиент, Палата, КойкоМесто, ДатаНачала, ДатаОкончания");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Палата) Тогда
		Документы.УстановкаУсловийПребывания.ЗаполнитьТарифыПоВидуПалаты(ЭтотОбъект);
		
		Если ЗначениеЗаполнено(Палата.Подразделение) Тогда
			Подразделение = Палата.Подразделение;
		КонецЕсли;
	КонецЕсли;
	
	// Прейскурант полиса имеет приоритет над прейскурантом палаты (обратное не решается размежеванием услуг)
	Если ЗначениеЗаполнено(Полис) Тогда
		ЗаполнитьПрейскурантИзПолиса();
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Изменения Макеев 08-01-2026 (
	Если ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
		ДатаОкончания = Дата(1,1,1);
	КонецЕсли;
	
	омг_ЗаполнитьМедицинскуюКартуПередЗаписью();
КонецПроцедуры

Процедура омг_ЗаполнитьМедицинскуюКартуПередЗаписью()
	
	Если Не омг_МедицинскаяКарта.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбращениеВСтационар.Клиент КАК Пациент,
	               |	ОбращениеВСтационар.МедицинскаяКарта.ВидКарты КАК ВидКарты,
	               |	ОбращениеВСтационар.МедицинскаяКарта КАК МедицискаяКарта
	               |ИЗ
	               |	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
	               |ГДЕ
	               |	ОбращениеВСтационар.Ссылка = &ДокументОбращения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.Пациент,
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.ВидКарты,
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.МедицискаяКарта
	               |ИЗ
	               |	РегистрСведений.омг_ТекущиеМедицинскиеКарты.СрезПоследних(
	               |			&Дата,
	               |			Пациент = &Пациент
	               |				И ВидКарты = &ВидКарты
	               |				И НЕ Регистратор = &ТекущийДокумент) КАК омг_ТекущиеМедицинскиеКартыСрезПоследних
	               |ГДЕ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.Активна";
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Пациент", Клиент);
	Запрос.УстановитьПараметр("ВидКарты", омг_ОсновнойВидКартСтационар());
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ДокументОбращения", ДокументОбращения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Медкарта = Выборка.МедицискаяКарта;
		
		омг_МедицинскаяКарта = Медкарта;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Изменения Макеев 08-01-2026 (
	// Укажем обязательные к заполнению поля
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураОбязательныхПолей = Новый Структура();
	Если ВидОперации <> Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
		Если Не ЗначениеЗаполнено(Полис) Тогда
			СтруктураОбязательныхПолей.Вставить("Прейскурант");
		КонецЕсли;
	КонецЕсли;
	
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Клиент",					 	"Ссылка.Клиент");
	СтруктураПолей.Вставить("Прейскурант",					"Ссылка.Прейскурант");
	СтруктураПолей.Вставить("Полис",						"Ссылка.Полис");
	СтруктураПолей.Вставить("ДатаНачала",					"Ссылка.ДатаНачала");
	СтруктураПолей.Вставить("ДатаОкончания",				"Ссылка.ДатаОкончания");
	СтруктураПолей.Вставить("Номенклатура",					"Номенклатура");
	
	РезультатЗапросаПоУслугам = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Номенклатура", СтруктураПолей);
	ТаблицаУслуг          = РезультатЗапросаПоУслугам.Выгрузить();
	
	// УМЦ Проверка отраслевых условий.
	ОтраслевыеДополнения.ПроверитьЗаполнениеДокумента(ЭтотОбъект, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		
		Стационар.ПроверитьВозможностьИзмененияСостоянияКойкоМеста(ЭтотОбъект,ТаблицаУслуг,Отказ);
		
	КонецЕсли;
	
	омг_ДеактивироватьМедицинскуюКарту();
	
КонецПроцедуры

Процедура омг_ДеактивироватьМедицинскуюКарту()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.Пациент КАК Пациент
	               |ИЗ
	               |	РегистрСведений.омг_ТекущиеМедицинскиеКарты.СрезПоследних(
	               |			&Дата,
	               |			Пациент = &Пациент
	               |				И НЕ Регистратор = &ТекущийДокумент) КАК омг_ТекущиеМедицинскиеКартыСрезПоследних
	               |ГДЕ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.МедицискаяКарта = &МедицискаяКарта";
	Запрос.УстановитьПараметр("МедицискаяКарта", омг_МедицинскаяКарта);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Пациент", Клиент);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Движения.омг_ТекущиеМедицинскиеКарты.Записывать = Истина;
		Запись = Движения.омг_ТекущиеМедицинскиеКарты.Добавить();
		Запись.Пациент = Клиент;
		Запись.ВидКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(омг_МедицинскаяКарта, "ВидКарты");
		Запись.МедицискаяКарта = омг_МедицинскаяКарта;
		Запись.Период = Дата;
		Запись.Активна = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция омг_ОсновнойВидКартСтационар() Экспорт
	
	ПрочиеНастройки = омг_МедицинскаяДеятельность.ПолучитьПрочиеНастройкиСистемы();
	ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар;
	Если ПрочиеНастройки.Свойство("ТипКартыСтационара") Тогда
		ТипКарты = ПрочиеНастройки.ТипКартыСтационара;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКарты", ТипКарты);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	ВидыМедицинскихКарт.ТипКарты = &ТипКарты
	|	И НЕ ВидыМедицинскихКарт.Архив"
	;
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Количество() = 1 Тогда
		Выб.Следующий();
		Возврат Выб.Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
		
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("Клиент");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииОбращения(ДокументОбращения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОбращения,,"Дата, Номер, ПометкаУдаления, Проведен, Ссылка");
		
	Если ЗначениеЗаполнено(ДокументОбращения.ДатаВремяГоспитализации) Тогда
		ЭтотОбъект.ДатаНачала = ДокументОбращения.ДатаВремяГоспитализации;
	КонецЕсли;
	
	ЭтотОбъект.ДокументОбращения = ДокументОбращения;
	
КонецПроцедуры

Процедура ЗаполнитьПрейскурантИзПолиса()
	
	ПрейскурантПолиса = Полис.ВидПолиса.Прейскурант;
	Если ЗначениеЗаполнено(ПрейскурантПолиса) Тогда
		Прейскурант = ПрейскурантПолиса;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Условия".
//
Процедура ПроверитьЗаполнениеТабличныхЧастей(ТаблицаПоУслугам, Отказ)

	// Общую процедуру проверки в этом документе звать нельзя, потому что номер строки в форме документа
	// отличается от системного.
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке табличной части Номенклатура номер "+ СокрЛП(ТаблицаПоУслугам.Индекс(СтрокаТаблицы)+ 1) 
										+" табличной части ";

		// Номенклатура.
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена Номенклатура.", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
